;; -*- no-byte-compile: t; -*-

(package! common-lisp-snippets)

(package! random-splash-image)

(package! org-auto-tangle)

(package! org-drill)

(package! org-download
  :recipe (:host github
           :repo "abo-abo/org-download"
           :files ("org-download.el")))

(package! org-pandoc-import
  :recipe (:host github
           :repo "tecosaur/org-pandoc-import"
           :files ("*.el" "filters" "preprocessors")))

(package! org-roam-ui)

(package! literate-lisp
  :recipe (:host github :repo "jingtaozf/literate-lisp"))

(package! sicp)

(package! clhs)

(package! paredit)

(package! command-log-mode)

(package! elcord)

(package! nov)

(package! rainbow-blocks)

(package! achievements)

(package! csv-mode)

(package! skeletor)

(package! simple-httpd)

(package! dfraw-mode
  :recipe (:host github :repo "pthariensflame/dfraw-mode"))

(package! lorem-ipsum)

(package! org-fragtog)

(package! ledger-import)

(package! literate-calc-mode)

(package! alarm-clock)

(package! affe)

(package! find-dired+)

(package! org-tanglesync)

(package! telega)

(package! palimpsest-mode)

(package! vulpea)

(package! nginx-mode)
